#language: ru
Функционал: Яндекс

  Сценарий: Проверка добавления в корзину зеркального фотоаппарата на ozon.ru

  Когда открыт сайт "www.ozon.ru"
  И развернуто окно на весь экран
  И выбран пункт меню – Электроника
  И выбрана категория – Зеркальные фотоаппараты
  И выбран производитель – Nikon
  И выбран производитель – Canon
  И заполнена цена - 80000
  И добавлен первый товар в корзину, запомнены название и цена
  И осуществлен переход в корзину
  Тогда проверить, что в корзине есть добавленный товар

  Когда нажата кнопка - удалить все
  Тогда проверить, что корзина пуста