#language: ru
Функционал: Яндекс

  Сценарий: Выбор наушников в Яндекс.Маркет

  Когда выбран пункт меню "Маркет"
  И выбран пункт меню Маркета "Электроника"
  И выбран подпункт "Наушники и Bluetooth-гарнитуры" в разделе "Портативная техника"
  И осуществлен переход в расширенный поиск "Перейти ко всем фильтрам"
  И задан параметр поиска от "5000" рублей
  И выбран производитель "Beats"
  И нажата кнопка "Показать подходящие"
  Тогда проверить, что элементов на странице больше или равно "12шт"
  И запомнить первый элемент в списке
  И ввести в поисковую строку запомненное значение
  И найти и проверить, что наименование товара соответствует запомненному значению
