#language: ru
Функционал: Яндекс

  Сценарий: Проверка добавления в корзину телефона Apple на ozon.ru

  Когда открыт сайт "www.ozon.ru"
  И развернуто окно на весь экран
  И выбран пункт меню – Электроника
  И выбрана категория – Телефоны
  И выбран производитель – Apple
  И заполнена цена - 50000
  И добавлен первый товар в корзину, запомнены название и цена
  И осуществлен переход в корзину
  Тогда проверить, что в корзине есть добавленный товар

  Когда нажата кнопка - удалить все
  Тогда проверить, что корзина пуста